app/Http/Controllers/AdminPostController.php

SELECT * FROM `posts` LIMIT 50 offset 0
SELECT count(*) as aggregate FROM `posts`
---
    public function index()
    {
        return view('admin.posts.index', [
            'posts' => Post::paginate(50)
        ]);

INSERT INTO `posts` (`title`, `thumbnail`, `slug`, `excerpt`, `body`, `category_id`, `user_id`, `updated_at`, `created_at`) VALUES ('The Importance of Maintaining a Healthy Lifestyle', 'thumbnails/Xt3poZQY8h8uFxbbJePgxSpTxFYMlNeYc0fUoFXQ.png', 'importance-of-maintaining-healthy-lifestyle', 'Learn the key factors in maintaining a healthy lifestyle and how small changes can lead to significant improvements in your overall well-being.', 'In today\'s fast-paced world, prioritizing health IS more important than ever. The benefits of maintaining a healthy lifestyle are endless, FROM boosting your energy levels to improving mental clarity. But adopting healthy habits doesn\'t require drastic changes — it’s the small, consistent actions that add up over time.\r\n\r\nWhy IS a Healthy Lifestyle Important:\r\nA healthy lifestyle can significantly impact your physical and mental well-being. It can prevent chronic diseases, increase longevity, and improve your mood. Leading a healthy lifestyle involves a balance of proper nutrition, physical activity, mental health, and adequate rest.\r\n\r\nA healthy lifestyle IS about balance. By making mindful choices in terms of nutrition, exercise, sleep, and mental well-being, you can experience improved health and overall happiness. It’s never too late to start making positive changes — your future self will thank you.', '3', 1, '2025-01-31 18:51:21', '2025-01-31 18:51:21')
---
    public function store()
    {
        Post::create(array_merge($this->validatePost(), [
            'user_id' => request()->user()->id,
            'thumbnail' => request()->file('thumbnail')->store('thumbnails')
        ]));

UPDATE `posts` SET `body` = 'Education IS rapidly evolving with technology, making learning more accessible, personalized, and engaging. Online platforms allow students to learn at their own pace, while AI-powered tools provide instant feedback and adaptive learning experiences. Innovations like virtual classrooms, project-based learning, and experiential teaching methods are transforming traditional education models. However, technology should complement, not replace, the human connection between teachers and students. The future of education lies in balancing digital advancements with meaningful personal interaction, ensuring holistic development and lifelong learning.', `posts`.`updated_at` = '2025-01-31 18:55:32' WHERE `id` = 4
---
    public function update(Post $post)
    {
        $attributes = $this->validatePost($post);

        if ($attributes['thumbnail'] ?? false) {
            $attributes['thumbnail'] = request()->file('thumbnail')->store('thumbnails');
        }

        $post->update($attributes);

DELETE FROM `posts` WHERE `id` = 1
---
    public function destroy(Post $post)
    {
        $post->delete();